perf/exchange-stress.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 300

  phases:
    - name: Ramp Up Extreme
      duration: 30
      arrivalRate: 100
      rampTo: 500
    - name: Plain Extreme
      duration: 30
      arrivalRate: 600
    - name: Ramp Down Extreme
      duration: 30
      arrivalRate: 500
      rampTo: 100
    - name: Stop
      duration: 20
      arrivalRate: 1

before:
  flow:
    - put:
        url: '/accounts/1/balance'
        json:
          balance: 999999999999
    - put:
        url: '/accounts/2/balance'
        json:
          balance: 999999999999

scenarios:
  - name: Refund ARS + Exchange USD->ARS
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 10
            baseAccountId: 2
            counterAccountId: 1