perf/exchange-stress.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-stress"

  pool: 300

  phases:
    - name: Warmup
      duration: 30
      arrivalRate: 5
      rampTo: 50
    - name: Sustained
      duration: 60
      arrivalRate: 50
    - name: Stress Ramp
      duration: 60
      arrivalRate: 50
      rampTo: 200
    - name: Peak Load
      duration: 60
      arrivalRate: 200
    - name: Cool Down
      duration: 30
      arrivalRate: 200
      rampTo: 10

before:
  flow:
    - put:
        url: '/accounts/1/balance'
        json:
          balance: 999999999999
    - put:
        url: '/accounts/2/balance'
        json:
          balance: 999999999999

scenarios:
  - name: Refund ARS + Exchange USD->ARS
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 10
            baseAccountId: 2
            counterAccountId: 1