perf/rates-put.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 20 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Intermittent Updates
      duration: 60
      arrivalRate: 1
    - name: Market Volatility
      duration: 30
      arrivalRate: 1
      rampTo: 6
    - name: Stabilization
      duration: 30
      arrivalRate: 2
    

scenarios:
  - name: Update Rate (/rates) - Actualizaciones intermitentes con volatilidad
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            rate: 1064